//=============================================================================
//
// リザルト画面処理 [result.h]
// Author : HAL東京_水野裕介
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define GOOD_END		(100)	// デモ用設定
#define NORMAL_END		(10)	// デモ用設定

enum
{
	ENDING_GOOD,		// Good
	ENDING_NORMAL,		// Never
	ENDING_BAD,			// Cat
	ENDING_DEAD,		// Dead
	ENDING_MAX

};


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitResult(void);
void UninitResult(void);
void UpdateResult(void);
void DrawResult(void);

void SetEnding(int ending);
