//=============================================================================
//
// あらすじ画面処理 [story.h]
// Author : 
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"
#include "debugproc.h"
#include "sprite.h"

//*****************************************************************************
// 構造体定義
//*****************************************************************************
struct STORY
{
	XMFLOAT3	pos;		// ポリゴンの座標
	float		w, h;		// 幅と高さ
	int			texNo;		// 使用しているテクスチャ番号
};



//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitStory(void);
void UninitStory(void);
void UpdateStory(void);
void DrawStory(void);




